УчетВУправляющихДляГит1/src/Documents/КВП_СвидетельствоОРегистрацииПоМестуПребывания/КВП_СвидетельствоОРегистрацииПоМестуПребывания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КВП_СвидетельствоОРегистрацииПоМестуПребывания</name>
  <basedOn>Document.КВП_ЗаявлениеОРегистрацииПоМестуПребывания</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.КВП_ЛицевыеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Проживающий</name>
    <type>
      <types>CatalogRef.УПЖКХ_Жильцы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.КВП_ЗаявлениеОРегистрацииПоМестуПребывания</types>
    </type>
  </attributes>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Documents/КВП_СвидетельствоОРегистрацииПоМестуПребывания/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДОКУМЕНТА

#Область ОбработчикиСобытийДокумента

// Процедура заполнения ввода на основании
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УПЖКХ_ТиповыеМетодыСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КВП_ЗаявлениеОРегистрацииПоМестуПребывания") Тогда
		
		ДокументОснование = ДанныеЗаполнения.Ссылка;

		Организация              = ДанныеЗаполнения.Организация;
		ЛицевойСчет              = ДанныеЗаполнения.ЛицевойСчет;
		Проживающий              = ДанныеЗаполнения.Проживающий;
		ДатаНачалаРегистрации    = ДанныеЗаполнения.ДатаНачалаРегистрации;
		ДатаОкончанияРегистрации = ДанныеЗаполнения.ДатаОкончанияРегистрации;
		Комментарий              = ДанныеЗаполнения.Комментарий;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ОбработкаПроверкиЗаполнения" документа.
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("Организация");
	ПроверяемыеРеквизиты.Добавить("Проживающий");
	ПроверяемыеРеквизиты.Добавить("ЛицевойСчет");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
